# Dataframe中索引(切片、iloc、loc、iat、at)

In [1]:
import pandas as pd

data = {'a':[11,22,33,44],
       'b':['aa','bb','cc','dd'],
       'c':[9,8,7,6],
        'd':[1,2,3,4]
       }
df = pd.DataFrame(data)
df

    a   b  c  d
0  11  aa  9  1
1  22  bb  8  2
2  33  cc  7  3
3  44  dd  6  4

![Image](66.png)

# 切片(Slice)：[start:end:step]
* 使用"方括號"能夠對DataFrame進行切片，有點像python的列表切片。
* start或end為空就代表到"底"
* setp為"負"時翻轉順序，[::-1]

# 一、df[ ]直接索引

* 使用"方括號"能夠對DataFrame進行切片，有點像python的列表切片。
* row為"位置"索引、column為"標籤"索引
* row為"單層"方括號、column為"雙層"方括號
* 多row用切片[num1:num2] (連續)、多column用標籤['tag1', 'tag2'] (離散)

In [47]:
# row
df[1:3]  #2~3 row

    a   b  c  d
1  22  bb  8  2
2  33  cc  7  3

In [6]:
df.a

0    11
1    22
2    33
3    44
Name: a, dtype: int64

In [139]:
# column
#對於多列選擇，不能像行選擇時一樣使用1：5這樣的方法來選擇，而是用逗號分割。
df[['b', 'd', 'c']]

    b  d  c
0  aa  1  9
1  bb  2  8
2  cc  3  7
3  dd  4  6

In [137]:
# 區塊(綜合前兩個)
df[:2][['b', 'd']]

    b  d
0  aa  1
1  bb  2

In [88]:
#row步長
df[::2]

    a   b  c  d
0  11  aa  9  1
2  33  cc  7  3

In [52]:
#翻轉row順序
df[::-1]

    a   b  c  d
3  44  dd  6  4
2  33  cc  7  3
1  22  bb  8  2
0  11  aa  9  1

# 二、 .iloc[row, [column]]

* row可用"位置"索引、column為"位置"索引
* 多row、多column時用切片[num1:num2] (連續)、[num1, num2] (離散)皆可
* 連續(切片)時為"單層"方括號、離散時為"雙層"方括號

In [153]:
# row (dtype: object)
df.iloc[0]

a    11
b    aa
c     9
d     1
Name: 0, dtype: object

In [142]:
# row
df.iloc[[0]]

    a   b  c  d
0  11  aa  9  1

In [149]:
# row
df.iloc[[0,0]]

    a   b  c  d
0  11  aa  9  1
0  11  aa  9  1

In [145]:
# 多row
df.iloc[0:2]

    a   b  c  d
0  11  aa  9  1
1  22  bb  8  2

In [72]:
# column
df.iloc[:, [1]]

    b
0  aa
1  bb
2  cc
3  dd

In [188]:
# column
df.iloc[1, 1]

'bb'

In [190]:
# column
df.iloc[[1], 1]

1    bb
Name: b, dtype: object

In [189]:
# column
df.iloc[1, [1]]

b    bb
Name: 1, dtype: object

In [191]:
# column
df.iloc[[1], [1]]

    b
1  bb

In [159]:
# 多column
df.iloc[:, [1, 2]]

    b  c
0  aa  9
1  bb  8
2  cc  7
3  dd  6

In [157]:
# 離散區塊
df.iloc[[1,2],[1,2]]

    b  c
1  bb  8
2  cc  7

In [156]:
# 連續區塊
df.iloc[0:1, 1:3]

    b  c
0  aa  9

In [74]:
# 連續+離散區塊
df.iloc[0:1,[1,2]]

    b  c
0  aa  9

In [161]:
# 離散+連續區塊
df.iloc[[1,2],0:2]

    a   b
1  22  bb
2  33  cc

# 三、 .loc[row, [column]]

* row可用"標籤"索引、column為"標籤"索引
* 多row、多column時用切片[num1:num2] (連續)、[num1, num2] (離散)皆可
* 連續(切片)時為"單層"方括號、離散時為"雙層"方括號

In [163]:
data = {'a':[11,22,33,44],
       'b':['aa','bb','cc','dd'],
       'c':[9,8,7,6],
        'd':[1,2,3,4]
       }
df1 = pd.DataFrame(data,index = ['a','b','c','d'])
df1

    a   b  c  d
a  11  aa  9  1
b  22  bb  8  2
c  33  cc  7  3
d  44  dd  6  4

In [11]:
df.loc[0] #选取第1行 因为第1行的行号是0所以和iloc效果相同

a    11
b    aa
c     9
d     1
Name: 0, dtype: object

In [164]:
# row
df1.loc['b']

a    22
b    bb
c     8
d     2
Name: b, dtype: object

In [165]:
# 多row
df1.loc['b':'c']

    a   b  c  d
b  22  bb  8  2
c  33  cc  7  3

In [179]:
#column
df1.loc[:,['a']]

    a
a  11
b  22
c  33
d  44

In [176]:
#多column
df1.loc[:,['a','b']]

    a   b
a  11  aa
b  22  bb
c  33  cc
d  44  dd

In [168]:
#區塊
df1.loc['a',['b','c']]

b    aa
c     9
Name: a, dtype: object

In [195]:
#區塊
df1.loc['a':'c',['b','c']]

    b  c
a  aa  9
b  bb  8
c  cc  7

In [196]:
#區塊
df1.loc[['b','c'],['b','c']]

    b  c
b  bb  8
c  cc  7

In [171]:
#區塊
df1.loc['a':'c', 'b':'c']

    b  c
a  aa  9
b  bb  8
c  cc  7

In [10]:
#條件
df.loc[df.a>11, 'a']

1    22
2    33
3    44
Name: a, dtype: int64

# .at
at的使用方法與loc類似，但是比loc有更快的訪問資料的速度，而且只能訪問單個元素，不能訪問多個元素。

In [199]:
df1.at['a','a']

11

# .iat
iat對於iloc的關係就像at對於loc的關係，是一種更快的基於索引位置的選擇方法，同at一樣只能訪問單個元素。

In [203]:
df1.iat[1,1]

'bb'

In [1]:
!pip install pynput

Collecting pynput
  Downloading pynput-1.7.1-py2.py3-none-any.whl (99 kB)
Requirement already satisfied: six in c:\users\11004076\anaconda3\lib\site-packages (from pynput) (1.12.0)
Installing collected packages: pynput
Successfully installed pynput-1.7.1

WARNING: pip is being invoked by an old script wrapper. This will fail in a future version of pip.
Please see https://github.com/pypa/pip/issues/5599 for advice on fixing the underlying issue.
To avoid this problem you can invoke Python with '-m pip' instead of running pip directly.
WARNING: You are using pip version 20.2.2; however, version 20.2.4 is available.
You should consider upgrading via the 'C:\Users\11004076\Anaconda3\python.exe -m pip install --upgrade pip' command.